vegeta/testcandidates/prisma/results/2018-07-08_19:11/albums_tracks_genre_some-700.txt
Requests      [total, rate]            42000, 654.40
Duration      [total, attack, wait]    1m12.394833358s, 1m4.18131874s, 8.213514618s
Latencies     [mean, 50, 95, 99, max]  6.477668013s, 5.998876797s, 13.112024806s, 16.052295066s, 20.923232892s
Bytes In      [total, mean]            19907118, 473.98
Bytes Out     [total, mean]            792946, 18.88
Success       [ratio]                  7.10%
Status Codes  [code:count]             200:2981  0:39019  
Error Set:
Post http://localhost:4466: net/http: timeout awaiting response headers
Post http://localhost:4466: dial tcp 0.0.0.0:0->127.0.0.1:4466: bind: address already in use
Post http://localhost:4466: read tcp 127.0.0.1:42264->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54109->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:57501->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54159->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54301->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54219->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54156->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:45745->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54148->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:41066->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54499->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42275->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54523->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54350->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54597->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54771->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54721->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54497->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54897->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54681->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54453->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54799->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54533->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:55033->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:41982->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54966->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:41249->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:33821->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:57462->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:51991->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54417->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:35913->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:52217->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:50910->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:38431->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42462->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:55049->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:34996->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:40768->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: EOF
Post http://localhost:4466: read tcp 127.0.0.1:58161->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:55607->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:38556->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:55439->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:34112->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:56083->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:57377->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:44879->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:43277->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42459->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:57228->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:55792->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:52218->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:38830->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:55629->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:55780->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:33189->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:51297->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54924->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:52387->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:37437->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42236->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:46108->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:57003->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:56715->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:39497->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:38384->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:34627->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:46677->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:43539->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:39757->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:41053->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:35605->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:38781->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:44941->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:50730->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:51623->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:41552->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:58400->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:60030->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:39547->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:58245->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54157->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:38863->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:40526->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:40781->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:56175->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:55803->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:35898->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:55977->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:60775->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:57314->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:58485->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:56128->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:58391->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:38810->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:58121->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:38416->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:36970->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42093->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:57673->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:58395->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42867->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:57001->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:56287->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:33301->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:52560->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:58297->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:44162->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:57183->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42089->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:57141->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:37152->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:57552->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54758->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:56889->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:57690->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:56223->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42193->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:55817->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:56159->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42503->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:40590->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:35222->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42406->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:56238->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42995->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:49216->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:43383->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:57866->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:58420->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:35293->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:39218->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:39622->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:39207->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:39010->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:41679->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:40184->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:39980->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:52593->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:57816->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:39856->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42176->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:51642->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:37547->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:46283->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:58693->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:39642->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:56061->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:47585->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:56987->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:42848->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54009->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: http: server closed idle connection
Post http://localhost:4466: read tcp 127.0.0.1:46404->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:45577->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: dial tcp 0.0.0.0:0->127.0.0.1:4466: i/o timeout
Post http://localhost:4466: dial tcp 0.0.0.0:0->127.0.0.1:4466: context deadline exceeded
Post http://localhost:4466: read tcp 127.0.0.1:39326->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:46418->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:50850->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:52445->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:52554->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: dial tcp: i/o timeout
Post http://localhost:4466: read tcp 127.0.0.1:56283->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:58585->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:58579->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:58775->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:34765->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:35604->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:36860->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:38710->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:34590->127.0.0.1:4466: read: connection reset by peer
Post http://localhost:4466: read tcp 127.0.0.1:54975->127.0.0.1:4466: read: connection reset by peer